================================================================================
Tag with the Ruby hash
================================================================================

%a{:title => @title, :href => href}

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (ruby_attributes))))

================================================================================
Tag with the buffered code
================================================================================

%p= "hello"

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (ruby_block_output
      (ruby_code))))

================================================================================
Tag with the buffered code that has spaces inside
================================================================================

%p= ['hi', 'there', 'reader!'].join " "

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (ruby_block_output
      (ruby_code))))

================================================================================
Tag with the child Ruby hashes
================================================================================

.book-info{:data => {:book => {:id => 123, :genre => 'programming'}, :category => 7}}

--------------------------------------------------------------------------------

(source_file
  (tag
    (class
      (class_name))
    (attributes
      (ruby_attributes))))

================================================================================
Tag with the child Ruby hashes v2
================================================================================

%div{:id => ['Article', @article.number], :class => ['article', 'entry', @article.visibility]}

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (ruby_attributes))))

================================================================================
Only evaluated Ruby code
================================================================================

= "simple text"

--------------------------------------------------------------------------------

(source_file
  (ruby_block_output
    (ruby_code)))

================================================================================
Only running Ruby code
================================================================================

- @variable = 'test'

--------------------------------------------------------------------------------

(source_file
  (ruby_block_run
    (ruby_code)))

================================================================================
Both running and evaluated Ruby code
================================================================================

- @variable = 'test'
= @variable

--------------------------------------------------------------------------------

(source_file
  (ruby_block_run
    (ruby_code))
  (ruby_block_output
    (ruby_code)))

================================================================================
Simple conditional
================================================================================

- if true
  %p= foo

--------------------------------------------------------------------------------

(source_file
  (ruby_block_run
    (ruby_code)
    (tag
      (tag_name)
      (ruby_block_output
        (ruby_code)))))

================================================================================
Ruby code stretched over multiple lines
:skip
================================================================================

= link_to_remote "Add to cart",
    :url => { :action => "add", :id => product.id },
    :update => { :success => "cart", :failure => "error" }

--------------------------------------------------------------------------------

(source_file
  (ruby_block_output
    (ruby_code)))

================================================================================
HTML-like attributes with Ruby interpolation inside
================================================================================

%span(class="widget_#{@widget.number}")

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (html_attributes
        (attribute
          (attribute_name)
          (quoted_attribute_value
            (attribute_value)
            (ruby_interpolation
              (ruby_expression))))))))

================================================================================
HTML-like attributes with Ruby value references
================================================================================

%input(foo=lvar bar=$gvar baz=@ivar waz=@@cvar lol=CONSTANT)

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (html_attributes
        (attribute
          (attribute_name)
          (ruby_value_ref
            (ruby_local_variable)))
        (attribute
          (attribute_name)
          (ruby_value_ref
            (ruby_global_variable)))
        (attribute
          (attribute_name)
          (ruby_value_ref
            (ruby_instance_variable)))
        (attribute
          (attribute_name)
          (ruby_value_ref
            (ruby_class_variable)))
        (attribute
          (attribute_name)
          (ruby_value_ref
            (ruby_constant)))))))

================================================================================
HTML-like attributes with Ruby value refrences and hash attributes
================================================================================

%input(foo=lvar bar=$gvar baz=@ivar waz=@@cvar lol=CONSTANT){
  asd: $hello
}

--------------------------------------------------------------------------------

(source_file
  (tag
    (tag_name)
    (attributes
      (html_attributes
        (attribute
          (attribute_name)
          (ruby_value_ref
            (ruby_local_variable)))
        (attribute
          (attribute_name)
          (ruby_value_ref
            (ruby_global_variable)))
        (attribute
          (attribute_name)
          (ruby_value_ref
            (ruby_instance_variable)))
        (attribute
          (attribute_name)
          (ruby_value_ref
            (ruby_class_variable)))
        (attribute
          (attribute_name)
          (ruby_value_ref
            (ruby_constant))))
      (ruby_attributes))))
